---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ForeignFileFailures.ForeignFile
source: html/bae54f52-dcfb-077a-af38-25d7a9aa027d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ForeignFileFailures.ForeignFile Property

This file [FamilyName] was saved by an application that was not developed or licensed by Autodesk.

## Syntax (C#)
```csharp
public static FailureDefinitionId ForeignFile { get; }
```